In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 데이터 정렬
#### index값 정렬
- sort_index : axis 사용 가능

#### column값 정렬
- sort_values

#### ascending
- True : 오름차순
- False : 내림차순

#### sort_index

In [ ]:
# index 정렬
df.sort_index(axis=0).head()

In [ ]:
# index 정렬
df.sort_index(axis=0, ascending=False).head()

In [ ]:
# axis = 1 => column index 정렬
df.sort_index(axis=1).head()

In [ ]:
# ascending 사용, False 내림차순
df.sort_index(axis=1, ascending=False).head()

#### sort_values
- 특정 컬럼 대상으로 컬럼 값 정렬

In [ ]:
# NaN은 제일 나중에, ascending의 초기값은 True
# df.sort_values(by='Age')
df.sort_values('Age')

In [ ]:
# NaN은 제일 나중에
df.sort_values('Age', ascending=False)

- 2개 이상의 컬럼 정렬

In [11]:
# 먼저 Pclass를 오름차순 정렬하고 그 기준으로 Age를 내림차순 정렬
df.sort_values(['Pclass', 'Age'], ascending=[True, False])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

### 분석용 함수
- count : data의 개수 - NaN 제외
- max, min : 최대값, 최소값 - NaN 제외
- sum, mean : 합계, 평균 - NaN 제외
- cumsum() : 누적 합

#### count

In [12]:
# 행기준
df.count(axis=0)

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [13]:
# 열기준
df.count(axis=1)

0      11
1      12
2      11
3      12
4      11
       ..
886    11
887    12
888    10
889    12
890    11
Length: 891, dtype: int64

#### max, min

In [14]:
# deprecated
df.max()

C:\Users\Public\Documents\ESTsoft\CreatorTemp/ipykernel_11100/1687624150.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max()

PassengerId                            891
Survived                                 1
Pclass                                   3
Name           van Melkebeke, Mr. Philemon
Sex                                   male
Age                                   80.0
SibSp                                    8
Parch                                    6
Ticket                           WE/P 5735
Fare                              512.3292
dtype: object

In [15]:
# 특정 컬럼을 선택 후 max, min
df['Age'].max()

80.0

In [16]:
df['Age'].min()

0.42

#### sum, mean

In [17]:
# deprecated
df.sum()

C:\Users\Public\Documents\ESTsoft\CreatorTemp/ipykernel_11100/3562679558.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum()

PassengerId                                               397386
Survived                                                     342
Pclass                                                      2057
Name           Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sex            malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                     21205.17
SibSp                                                        466
Parch                                                        340
Ticket         A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                  28693.9493
dtype: object

In [18]:
df['Age'].sum()

21205.17

In [19]:
df['Age'].mean()

29.69911764705882

#### skipna : NaN값이 있는 column은 NaN 값으로 출력

In [20]:
df['Age'].mean(skipna=False)

nan

In [21]:
df['Pclass'].max(skipna=False)

3

In [22]:
df['Pclass'].isna().sum()

0

#### cumsum : 누적

In [23]:
df['Age'].cumsum()

0         22.00
1         60.00
2         86.00
3        121.00
4        156.00
         ...
886    21128.17
887    21147.17
888         NaN
889    21173.17
890    21205.17
Name: Age, Length: 891, dtype: float64

#### unique : 유일값, nunique : 유일값 개수

In [24]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [25]:
df['Sex'].nunique()

2

In [27]:
df['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [28]:
df['Pclass'].nunique()

3

#### mode : 가장 많이 나온 data

In [30]:
df['Pclass'].mode()

0    3
dtype: int64

In [31]:
df['Sex'].mode()

0    male
dtype: object